tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"

brew "direnv"
brew "fish"
brew "fzf"
brew "git"
brew "htop"
brew "tmux"
brew "overmind"
brew "swiftlint"
brew "neovim"
brew "jq"
brew "pnpm"
brew "1password-cli"
brew "jdx/tap/usage"
brew "mise"
brew "ranger"
brew "zoxide"
brew "joshmedeski/sesh/sesh"
brew "jesseduffield/lazygit/lazygit" # https://github.com/jesseduffield/lazygit
brew "ripgrep"                       # https://github.com/BurntSushi/ripgrep

cask "alt-tab"
cask "alacritty"
