def personal? = (File.read(File.expand_path("~/.machineid")).strip rescue "") == "personal"

tap "homebrew/bundle"
tap "homebrew/services"

tap "hashicorp/tap"
tap "arl/arl"
tap "joshmedeski/sesh"
tap "jesseduffield/lazygit"

# Brews
brew "awscli"
brew "chezmoi"
brew "cmake"
brew "direnv"
brew "fish"
brew "fzf"
brew "git"
brew "htop"
brew "tmux"
brew "overmind"
brew "neovim"                          # https://github.com/neovim/neovim
brew "jq"
brew "mise"
brew "ranger"
brew "zoxide"
brew "joshmedeski/sesh/sesh"
brew "jesseduffield/lazygit/lazygit"   # https://github.com/jesseduffield/lazygit
brew "ripgrep"                         # https://github.com/BurntSushi/ripgrep
brew "luarocks"                        # https://github.com/luarocks/luarocks
brew "gitmux"                          # https://github.com/arl/gitmux
brew "gh"
brew "k6"
brew "rbspy"
brew "mysql-client@8.4"
brew "zellij"
brew "watchman"
brew "uv"

if personal?
  brew "swiftlint"
  brew "odnoletkov/tap/xcodeproj-format"
  brew "xcodesorg/made/xcodes"
end

# Casks
cask "1password"
cask "1password-cli"
cask "alt-tab"
cask "alacritty"
cask "font-hack-nerd-font"
cask "zed"
cask "arc"
cask "raycast"
cask "figma"
cask "istat-menus"
cask "chatgpt"
cask "discord"
cask "spotify"
cask "sublime-merge"
cask "raindropio"
cask "obsidian"
cask "telegram"
cask "zoom"
cask "postman"
cask "orbstack"
cask "bartender"
cask "github-copilot-for-xcode" if personal?
cask "sf-symbols" if personal?
cask "cursor"
cask "ghostty"
cask "claude"

# Mases
mas "Paste", id: 967_805_235
mas "Perplexity", id: 6_714_467_650

if personal?
  mas "Xcode", id: 497_799_835
  mas "TestFlight", id: 899_247_664
  mas "Apple Developer", id: 640_199_958
end
